wintersmith/contents/articles/Java/2015-02-25-disruptor-bootstrap.html
---
date: 2015-02-25 00:29:03
template: tech.jade
title: Disruptor 设计分析
category: Java
chage_frequency: monthly
tag: Java,disruptor
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">RingBuffer</a></li>
<li><a href="#sec-2">Publisher</a></li>
<li><a href="#sec-3">Sequencer</a></li>
<li><a href="#sec-4">SequenceBarrier</a></li>
<li><a href="#sec-5">Sequence</a></li>
<li><a href="#sec-6">WaitStrategy</a></li>
<li><a href="#sec-7">EventHandler</a></li>
<li><a href="#sec-8">EventProcessor</a></li>
<li><a href="#sec-9">Event</a></li>
<li><a href="#sec-10">Cache Line alignment</a></li>
<li><a href="#sec-11">Memory Barrier</a></li>
<li><a href="#sec-12">UNSAFE</a></li>
</ul>
</div>
</div>

<p>
Disruptor 是Java语言编写的非常高性能的并发框架，比Java的原生支持的同步工具更具有并发良好性。
</p>

<p>
希望在此能够不断积累纪录整个学习此框架代码的收获。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">RingBuffer</h2>
<div class="outline-text-2" id="text-1">
<p>
RingBuffer 是一个有限容量（bufferSize）无限长的环（Sequencer）。内部表示为数组。它的每个元素在初始化的时候被预填充成Event。
</p>

<p>
RingBuffer的实现为了使得高效，做了很多底层技巧，如pad字段来使cacheLine对齐从而减少cache miss。
</p>

<p>
整个disruptor的核心就是RingBuffer，Disruptor类仅仅是一个配置RingBuffer的界面，初始化RingBuffer包括配置EventHandler，配置EventHandler的执行器，配置Buffer的容量，配置batchSize——一次最大发送的事件数。
</p>

<p>
RingBuffer有个Sequencer来纪录它的写入光标，以及待读取光标集合，避免覆盖等等。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Publisher</h2>
<div class="outline-text-2" id="text-2">
<p>
发布者，可以定义多发布者的模型，也可以定义单发布者的模型。这在配置RingBuffer的时候设置。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Sequencer</h2>
<div class="outline-text-2" id="text-3">
<p>
Sequencer 是实现producer／consumer同步的核心，它维护有个Courser，代表当前可写入位置，以及一组配置进来的gateSequences，代表了多个消费者当前的消费进度。
</p>

<p>
这样就可以检查可写入的区域。
</p>

<p>
每次要发布消息的时候，需要调用Sequencer的next方法，目标是申请一段（可能一个）空闲的RingBuffer区域，
</p>

<p>
next 函数是同步的关键，它使用CAS无锁算法，检查所申请的空间和可申请的空间是否满足匹配，如果满足移动coursor的位置来达到申请，并返回给调用者申请空间的序号：sequence。
</p>

<p>
拿到sequence的进程就非常轻松，因为这段区域是留给他们的，不存在竞争问题。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">SequenceBarrier</h2>
<div class="outline-text-2" id="text-4">
<p>
Barrier 上面用来实现publisher和processor的同步通知，producer在发布后可以notifyAll所有hold在barrier上面的processor，
而processor在wait其目标sequence的时候，如果没有到达可以选择进行block在barrier上面。
</p>

<p>
wait策略可以自己选择。
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Sequence</h2>
<div class="outline-text-2" id="text-5">
<p>
RingBuffer 的index就是sequence，内部包装了一个long型的整数，它比较简单，就是代表一个buffer里面的位置。
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">WaitStrategy</h2>
<div class="outline-text-2" id="text-6">
<p>
event processor 在barrier上面等待的策略，默认有好几种帮你实现了，分别根据不同的业务需求进行选择，都有注释。
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">EventHandler</h2>
<div class="outline-text-2" id="text-7">
<p>
事件处理函数的接口，用户定义然后设置给Disruptor。
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">EventProcessor</h2>
<div class="outline-text-2" id="text-8">
<p>
processor是内部的事件处理器，每个传入的EventHandler都会被封装成Processor然后管理起来。这个类一般不需要自己设置。
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Event</h2>
<div class="outline-text-2" id="text-9">
<p>
Ringbuffer里面的Event仅仅是占位的，需要我们自己填充具体数据，然后再publish。
</p>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Cache Line alignment</h2>
<div class="outline-text-2" id="text-10">
<p>
RingBuffer开头有许多古怪的代码，目标是为了填充满Cpu的数据Cache的CacheLine，这样可以非常高效的操作数据，减少内存访问。
</p>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Memory Barrier</h2>
<div class="outline-text-2" id="text-11">
<p>
Store/Store，Store/Load &#x2026;
</p>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">UNSAFE</h2>
<div class="outline-text-2" id="text-12">
<p>
框架里面使用了大量的unsafe操作，值得借鉴和学习。
</p>
</div>
</div>
